Dlubal.RFEM5.AverageRegion
Average region parameters

Dlubal.RFEM5.AverageRegion.No
Number

Dlubal.RFEM5.AverageRegion.ID
Identifier

Dlubal.RFEM5.AverageRegion.Tag
Tag

Dlubal.RFEM5.AverageRegion.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.AverageRegion.IsGenerated
Information if the object is generated or not (read only)

Dlubal.RFEM5.AverageRegion.Description
Description

Dlubal.RFEM5.AverageRegion.SurfaceList
List of surfaces

Dlubal.RFEM5.AverageRegion.AngularRotation
Angular rotation

Dlubal.RFEM5.AverageRegion.CenterPoint
Center of the average region

Dlubal.RFEM5.AverageRegion.Form
Form of the average region

Dlubal.RFEM5.AverageRegion.Dimension1
First dimension

Dlubal.RFEM5.AverageRegion.Dimension2
Second dimension

Dlubal.RFEM5.AverageRegion.DirectionUWithMx
Direction u with moment mx

Dlubal.RFEM5.AverageRegion.DirectionUWithMy
Direction u with moment my

Dlubal.RFEM5.AverageRegion.DirectionUWithVx
Direction u with force vx

Dlubal.RFEM5.AverageRegion.DirectionUWithVy
Direction u with force vy

Dlubal.RFEM5.AverageRegion.DirectionUWithMxy
Direction u with moment mxy

Dlubal.RFEM5.AverageRegion.DirectionUWithNxy
Direction u with force nxy

Dlubal.RFEM5.AverageRegion.DirectionUWithNx
Direction u with force nx

Dlubal.RFEM5.AverageRegion.DirectionUWithNy
Direction u with force ny

Dlubal.RFEM5.AverageRegion.DirectionVWithMx
Direction v with moment mx

Dlubal.RFEM5.AverageRegion.DirectionVWithMy
Direction v with moment my

Dlubal.RFEM5.AverageRegion.DirectionVWithVx
Direction v with force vx

Dlubal.RFEM5.AverageRegion.DirectionVWithVy
Direction v with force vy

Dlubal.RFEM5.AverageRegion.DirectionVWithMxy
Direction v with moment mxy

Dlubal.RFEM5.AverageRegion.DirectionVWithNxy
Direction v with force nxy

Dlubal.RFEM5.AverageRegion.DirectionVWithNx
Direction v with force nx

Dlubal.RFEM5.AverageRegion.DirectionVWithNy
Direction v with force ny

Dlubal.RFEM5.AverageRegion.Projection
Type of the average region projection

Dlubal.RFEM5.AverageRegion.ProjectionVector
Vector of projection direction

Dlubal.RFEM5.AverageRegion.ResultValuesToZero
Set result values over the entire region to zero

Dlubal.RFEM5.AverageRegion.DistributionOfInternalForces
Distribution of internal forces